Revit 2024 API
BuiltInFailures.SectionViewFailures Class
 Failures about Section.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class SectionViewFailures
Visual Basic
Public NotInheritable Class SectionViewFailures
Visual C++
public ref class SectionViewFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SectionViewFailures
See Also
BuiltInFailures.SectionViewFailures Members
Autodesk.Revit.DB Namespace